Repository: KryptonGao/StudyPulse
Catalog: StudyPulse/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

source: Answers to common questions about using StudyPulse.
ja: StudyPulseの使い方に関するよくある質問です。
ko: StudyPulse 사용에 관한 자주 묻는 질문과 답변입니다.
zh_hans: 关于使用 StudyPulse 的常见问题解答。
zh_hant: 關於使用 StudyPulse 的常見問題解答。

source: API Key
ja: API キー
ko: API 키
zh_hans: API 密钥
zh_hant: API 金鑰

source: App information, version and license details.
ja: アプリ情報、バージョン、ライセンスの詳細。
ko: 앱 정보, 버전 및 라이선스 세부 정보.
zh_hans: 应用信息、版本号与许可详情。
zh_hant: 應用資訊、版本號與授權詳情。

source: App Language
ja: アプリ言語
ko: 앱 언어
zh_hans: 应用语言
zh_hant: 應用語言

source: App language can be changed here independently of the system language.
ja: システム言語とは別に、ここでアプリの言語を変更できます
ko: 시스템 언어와 별도로 여기서 앱 언어를 변경할 수 있습니다
zh_hans: 可在此处独立于系统语言更改应用语言
zh_hant: 可在此處獨立於系統語言變更應用程式語言

source: App Preferences
ja: アプリの設定
ko: 앱 환경설정
zh_hans: 应用偏好
zh_hant: 應用程式偏好

source: App version
ja: App バージョン
ko: App 버전
zh_hans: App 版本
zh_hant: App 版本

source: Appearance
ja: 外観
ko: 모양
zh_hans: 外观
zh_hant: 外觀

source: Appearance & Layout
ja: 外観とレイアウト
ko: 모양 및 레이아웃
zh_hans: 外观与布局
zh_hant: 外觀與佈局

source: Apple Health
ja: Appleヘルス
ko: Apple 건강
zh_hans: Apple 健康
zh_hant: Apple 健康

source: Apple Watch users get the most accurate signals. iPhone-only users can still see sleep data from manually logged entries or connected third-party apps.
ja: Apple Watch 使用者は最も正確なシグナルを取得できます。iPhone のみの場合でも、手動入力や連携済みサードパーティ App から睡眠データを確認できます。
ko: Apple Watch 사용자는 가장 정확한 신호를 얻을 수 있습니다. iPhone만 사용해도 수동 기록 또는 연동된 서드파티 앱에서 수면 데이터를 볼 수 있습니다.
zh_hans: Apple Watch 用户可获得最准确的信号。仅使用 iPhone 的用户也能看到睡眠数据，前提是手动记录或连接了第三方 App。
zh_hant: Apple Watch 使用者可獲得最準確的訊號。僅使用 iPhone 的使用者也能看到睡眠資料，前提是手動記錄或連接了第三方 App。

source: Application logs have been exported.
ja: アプリケーションログがエクスポートされました。
ko: 애플리케이션 로그가 내보내기되었습니다.
zh_hans: 应用日志已导出。
zh_hant: 應用程式日誌已匯出。

source: Apply
ja: 適用
ko: 적용
zh_hans: 应用
zh_hant: 套用

source: Apply Smart Recommendation
ja: スマート推奨を適用
ko: 스마트 추천 적용
zh_hans: 应用智能推荐
zh_hant: 應用智能推薦

source: Apply Smart Subject Recommendation
ja: スマート科目推奨を適用
ko: 스마트 과목 추천 적용
zh_hans: 应用智能科目推荐
zh_hant: 應用智能科目推薦

source: Approved
ja: 承認済み
ko: 승인됨
zh_hans: 已批准
zh_hant: 已批准

source: Archived
ja: アーカイブ済み
ko: 보관됨
zh_hans: 已归档
zh_hant: 已封存

source: Archived (%d)
ja: アーカイブ済み (%d)
ko: 보관됨 (%d)
zh_hans: 已归档 (%d)
zh_hant: 已封存 (%d)

source: Around 6-7 hours of sleep. Stick to revision and easy problems today; save deep focus for after a good night's rest.
ja: 睡眠時間は約 6〜7 時間。今日復習中心・易しい問題にし、深い集中はよく眠った後にとっておきましょう。
ko: 6~7시간 정도 잠을 잤습니다. 오늘은 복습과 쉬운 문제 위주로, 깊은 집중은 충분히 주무신 다음으로 미루세요.
zh_hans: 睡眠约 6-7 小时。今天以复习和简单题为主；充分休息后再进行深度学习。
zh_hant: 睡眠約 6-7 小時。今天以複習和簡單題為主；充分休息後再進行深度學習。

source: Art
ja: 美術
ko: 미술
zh_hans: 美术
zh_hant: 視覺藝術

source: Ask about your grades, mistakes, or exams.
ja: 成績、間違い、試験について質問してください。
ko: 성적, 오답, 시험에 대해 질문하세요.
zh_hans: 询问你的成绩、错题或考试相关问题。
zh_hant: 詢問你的成績、錯題或考試相關問題。

source: Ask about your plan, progress, or next step.
ja: 計画、進捗、次のステップを質問できます。
ko: 계획, 진행 상황 또는 다음 단계를 물어보세요.
zh_hans: 可以询问计划、进度或下一步。
zh_hant: 可以詢問計畫、進度或下一步。

source: Ask anything...
ja: 何でも聞いてください...
ko: 무엇이든 물어보세요...
zh_hans: 说点什么...
zh_hant: 說點什麼...

source: Ask questions about your grades, mistakes, or exams.
ja: 成績、間違い、試験について質問できます。
ko: 성적, 오답, 시험에 대해 질문할 수 있습니다.
zh_hans: 基于你的成绩、错题、考试数据自由提问。
zh_hant: 基於你的成績、錯題、考試資料自由提問。

source: Assessment
ja: 評価
ko: 평가
zh_hans: 评估
zh_hant: 評估

source: Assign
ja: 取り込む
ko: 할당
zh_hans: 归入
zh_hant: 歸入

source: Assign existing data
ja: 既存データを取り込む
ko: 기존 데이터 할당
zh_hans: 归入现有数据
zh_hant: 歸入現有資料

source: Assign existing data?
ja: 既存データを取り込みますか?
ko: 기존 데이터를 할당하시겠습니까?
zh_hans: 归入现有数据?
zh_hant: 歸入現有資料?

source: Attribution
ja: 表示
ko: 표시
zh_hans: 署名
zh_hant: 署名

source: Attribution — NonCommercial — ShareAlike — 4.0 International
ja: 表示 — 非営利 — 継承 — 4.0 国際
ko: 표시 — 비영리 — 동일조건변경허락 — 4.0 국제
zh_hans: 署名 — 非商业性使用 — 相同方式共享 — 4.0 国际
zh_hant: 署名 — 非商業性 — 相同方式分享 — 4.0 國際

source: Authentication failed. Check your API Key.
ja: 認証に失敗しました。API キーを確認してください。
ko: 인증에 실패했습니다. API 키를 확인하세요.
zh_hans: 鉴权失败,请检查 API 密钥。
zh_hant: 驗證失敗,請檢查 API 金鑰。

source: Auto
ja: 自動
ko: 자동
zh_hans: 自动
zh_hant: 自動

source: Auto Mind Map
ja: マインドマップ
ko: 오답 마인드맵
zh_hans: 智能思维导图
zh_hant: 智能思維導圖

source: Auto-schedule reviews using SM-2 algorithm
ja: SM-2 アルゴリズムで復習を自動スケジュール
ko: SM-2 알고리즘으로 복습 자동 예약
zh_hans: 使用 SM-2 算法自动安排复习
zh_hant: 使用 SM-2 演算法自動安排複習

source: Automatic Reports
ja: 自動レポート
ko: 자동 보고서
zh_hans: 自动报告
zh_hant: 自動報告

source: Average
ja: 平均
ko: 평균
zh_hans: 平均
zh_hant: 平均

source: Average Energy
ja: 平均エネルギー
ko: 평균 에너지
zh_hans: 平均精力
zh_hant: 平均精力

source: Average Mood
ja: 平均気分
ko: 평균 기분
zh_hans: 平均心情
zh_hant: 平均心情

source: Average Rank
ja: 平均順位
ko: 평균 순위
zh_hans: 平均排名
zh_hant: 平均排名

source: Average Score
ja: 平均点
ko: 평균 점수
zh_hans: 平均分
zh_hant: 平均分

source: Avg Mastery
ja: 平均習得度
ko: 평균 숙지도
zh_hans: 平均掌握度
zh_hant: 平均掌握度

source: Avg Score
ja: 平均得点
ko: 평균 점수
zh_hans: 平均得分
zh_hant: 平均得分

source: Back
ja: 戻る
ko: 뒤로
zh_hans: 返回
zh_hant: 返回

source: Back to Mistakes & Basics
ja: 間違いと基礎に戻る
ko: 오답과 기초로 돌아가기
zh_hans: 回到错题与基础
zh_hant: 回到錯題與基礎

source: Backlog
ja: タスクの滞留
ko: 할 일 누적
zh_hans: 待办积压
zh_hant: 待辦積壓

source: Backup contents
ja: バックアップ内容
ko: 백업 내용
zh_hans: 备份内容
zh_hant: 備份內容

source: Backup created successfully.
ja: バックアップを作成しました。
ko: 백업을 만들었습니다.
zh_hans: 备份创建成功。
zh_hant: 備份建立成功。

source: Backup data could not be decoded: %@
ja: バックアップデータをデコードできません：%@
ko: 백업 데이터를 디코딩할 수 없습니다: %@
zh_hans: 无法解码备份数据：%@
zh_hant: 無法解碼備份資料：%@

source: Backup Error
ja: バックアップエラー
ko: 백업 오류
zh_hans: 备份错误
zh_hant: 備份錯誤

source: Backup format version %d is not supported.
ja: バックアップ形式バージョン %d はサポートされていません。
ko: 백업 형식 버전 %d은(는) 지원되지 않습니다.
zh_hans: 不支持备份格式版本 %d。
zh_hant: 不支援備份格式版本 %d。

source: Backup integrity check failed for %@.
ja: %@ の整合性チェックに失敗しました。
ko: %@의 백업 무결성 검사에 실패했습니다.
zh_hans: %@ 的备份完整性校验失败。
zh_hant: %@ 的備份完整性驗證失敗。

source: Backup record count does not match for %@.
ja: %@ のレコード数が一致しません。
ko: %@의 백업 레코드 수가 일치하지 않습니다.
zh_hans: %@ 的备份记录数量不匹配。
zh_hant: %@ 的備份記錄數量不符。

source: Backup relationships are invalid: %@
ja: バックアップの関連が無効です：%@
ko: 백업 관계가 올바르지 않습니다: %@
zh_hans: 备份关系无效：%@
zh_hant: 備份關係無效：%@

source: Backup Summary
ja: バックアップ概要
ko: 백업 요약
zh_hans: 备份摘要
zh_hant: 備份摘要

source: Backup validation succeeded.
ja: バックアップの検証に成功しました。
ko: 백업 검증에 성공했습니다.
zh_hans: 备份验证成功。
zh_hant: 備份驗證成功。

source: Balance your subjects
ja: 科目のバランスを
ko: 과목 균형 맞추기
zh_hans: 平衡你的科目
zh_hant: 平衡你的科目

source: Bar Chart
ja: 棒グラフ
ko: 막대 차트
zh_hans: 柱状图
zh_hant: 柱狀圖

source: Base URL
ja: エンドポイント URL
ko: 엔드포인트 URL
zh_hans: API 端点
zh_hant: API 端點

source: Based on %d exams, ±%.1f pts
ja: %d 回の試験に基づく、誤差約 ±%.1f 点
ko: %d회 시험 기반, 오차 약 ±%.1f 점
zh_hans: 基于 %d 次考试,误差约 ±%.1f 分
zh_hant: 基於 %d 次考試,誤差約 ±%.1f 分

source: Baseline
ja: ベースライン
ko: 기준선
zh_hans: 基线
zh_hant: 基準

source: Baseline %@ · Target %@ · Weight %@
ja: 基準 %@ · 目標 %@ · 重み %@
ko: 기준 %@ · 목표 %@ · 가중치 %@
zh_hans: 基线 %@ · 目标 %@ · 权重 %@
zh_hant: 基準 %@ · 目標 %@ · 權重 %@

source: Basic
ja: 基礎
ko: 기초
zh_hans: 基础
zh_hant: 基礎

source: Basic Info
ja: 基本情報
ko: 기본 정보
zh_hans: 基本信息
zh_hant: 基本資訊

source: Biology
ja: 生物
ko: 생물
zh_hans: 生物
zh_hant: 生物

source: Blue
ja: ブルー
ko: 블루
zh_hans: 蓝色
zh_hant: 藍色

source: Body is ready for deep work
ja: 深い学習に最適
ko: 딥 워크 준비 완료
zh_hans: 身体已准备好深度学习
zh_hant: 身體已準備好深度學習

source: Body is still winding down
ja: 体がまだ冷めきっていない
ko: 아직 몸이 식지 않음
zh_hans: 身体尚未完全放松
zh_hant: 身體尚未完全放鬆

source: Body Signals Tailor Your Suggestions
ja: 体のシグナルが提案を最適化
ko: 신체 신호로 맞춤 제안
zh_hans: 身体信号让建议更贴切
zh_hant: 身體訊號讓建議更貼切

source: Body status history is health-related sensitive information. It is excluded by default.
ja: 身体状態の履歴は健康に関する機微情報です。既定では除外されます。
ko: 신체 상태 기록은 건강 관련 민감 정보이며 기본적으로 제외됩니다.
zh_hans: 身体状态历史属于健康相关敏感信息，默认不包含。
zh_hant: 身體狀態歷史屬於健康相關敏感資訊，預設不包含。

source: Brain Usage
ja: 脳の使用量
ko: 두뇌 사용량
zh_hans: 大脑使用量
zh_hant: 大腦使用量

source: Brain Usage Goal Reached
ja: 脳の使用量目標を達成
ko: 두뇌 사용량 목표 달성
zh_hans: 大脑使用量目标已达到
zh_hant: 大腦使用量目標已達成

source: Breakdown
ja: 内訳
ko: 분포
zh_hans: 分布
zh_hant: 分佈

source: Breathing is a bit fast
ja: 呼吸がやや速い
ko: 호흡이 약간 빠름
zh_hans: 呼吸频率偏高
zh_hant: 呼吸頻率偏高

source: Building
ja: 構築中
ko: 구축 중
zh_hans: 逐渐建立
zh_hant: 逐漸建立

# burnout.adviceHigh
source: High load-recovery imbalance: sleep earlier tonight and reduce tomorrow's study load.
ja: 負荷と回復の不均衡が大きい状態です。今夜は早く寝て、明日の負荷を下げましょう。
ko: 부하와 회복의 불균형이 커요. 오늘은 일찍 자고 내일 학습 부하를 낮추세요.
zh_hans: 负荷与恢复失衡较明显：今晚提早就寝，明天降低学习负荷。
zh_hant: 負荷與恢復失衡較明顯：今晚提早就寢，明天降低學習負荷。

# burnout.adviceLow
source: No clear burnout signal is detected; keep a sustainable rhythm.
ja: 明確な燃え尽きサインはありません。無理のないリズムを保ちましょう。
ko: 뚜렷한 번아웃 신호는 없어요. 지속 가능한 리듬을 유지하세요.
zh_hans: 暂未发现明显倦怠信号，保持可持续的学习节奏。
zh_hant: 暫未發現明顯倦怠訊號，保持可持續的學習節奏。

# burnout.adviceWatch
source: Recovery needs attention; consider inserting a rest day and watch the next few nights.
ja: 回復に注意が必要です。休息日を入れ、数日間の睡眠を見守りましょう。
ko: 회복에 주의가 필요해요. 휴식일을 넣고 앞으로 며칠간 수면을 살펴보세요.
zh_hans: 恢复需要关注，考虑插入休息日，并观察接下来几晚的睡眠。
zh_hant: 恢復需要關注，考慮插入休息日，並觀察接下來幾晚的睡眠。

# burnout.coldStartHint
source: Keep recording Health data to make burnout detection more reliable.
ja: 燃え尽き検知の精度を上げるには、ヘルスデータを記録してください。
ko: 번아웃 감지를 더 정확하게 하려면 건강 데이터를 계속 기록하세요.
zh_hans: 继续记录健康数据，倦怠检测会更可靠。
zh_hant: 持續記錄健康資料，倦怠偵測會更可靠。

# burnout.title
source: Burnout warning
ja: 燃え尽き注意
ko: 번아웃 주의
zh_hans: 倦怠预警
zh_hant: 倦怠預警

# burnout.trigger.hrvDecline
source: Recovery score is declining (%+.2f points/day).
ja: 回復スコアが低下しています（1日あたり%+.2fポイント）。
ko: 회복 점수가 하락 중이에요(하루 %+.2f포인트).
zh_hans: 恢复分正在下降（每天 %+.2f 个百分点）。
zh_hant: 恢復分正在下降（每天 %+.2f 個百分點）。

# burnout.trigger.loadSpike
source: High-intensity study has continued for %d days.
ja: 高強度学習が%d日続いています。
ko: 고강도 학습이 %d일 연속이에요.
zh_hans: 高强度学习已连续 %d 天。
zh_hant: 高強度學習已連續 %d 天。

# burnout.trigger.moodDecline
source: Mood and energy are declining compared with the previous week.
ja: 気分とエネルギーが前週より低下しています。
ko: 기분과 에너지가 지난주보다 떨어지고 있어요.
zh_hans: 心情和精力较前一周下滑。
zh_hant: 心情和精力較前一週下滑。

# burnout.trigger.overtraining
source: Exercise exceeded 120 minutes on a high-load day.
ja: 高負荷の日に運動が120分を超えています。
ko: 학습 부하가 높은 날 운동이 120분을 넘었어요.
zh_hans: 高学习负荷日的锻炼超过 120 分钟。
zh_hant: 高學習負荷日的運動超過 120 分鐘。

# burnout.trigger.rhrElevation
source: Today's resting heart rate is elevated versus the recent average.
ja: 今日の安静時心拍数が最近の平均より高くなっています。
ko: 오늘 안정시 심박수가 최근 평균보다 높아요.
zh_hans: 今天的静息心率高于近期平均。
zh_hant: 今天的靜息心率高於近期平均。

# burnout.trigger.sleepDebt
source: At least two of the last five nights had low restorative sleep.
ja: 直近5夜のうち少なくとも2夜で回復性睡眠が少なめでした。
ko: 최근 5일 밤 중 2일 이상 회복 수면이 부족했어요.
zh_hans: 最近 5 晚中至少有 2 晚恢复性睡眠不足。
zh_hant: 最近 5 晚中至少有 2 晚恢復性睡眠不足。

source: By Date Range
ja: 期間指定
ko: 기간 지정
zh_hans: 按时间范围
zh_hant: 依時間範圍

source: By Mistakes
ja: 問題別
ko: 문제별
zh_hans: 按错题
zh_hant: 依錯題

source: By Subject
ja: 科目別
ko: 과목별
zh_hans: 按科目
zh_hant: 依科目

source: By Subjects
ja: 科目別
ko: 과목별
zh_hans: 按科目
zh_hant: 依科目

source: Cache Categories
ja: キャッシュのカテゴリー
ko: 캐시 카테고리
zh_hans: 缓存分类
zh_hant: 快取分類

source: Cache Cleared
ja: キャッシュを消去しました
ko: 캐시를 지웠습니다
zh_hans: 缓存已清除
zh_hant: 快取已清除

source: Cache data can be regenerated. Clearing it will not delete grades, mistakes, diaries, recordings, health history, or other personal data.
ja: キャッシュは次回使用時に再生成できます。成績、間違い、日記、録音、ヘルスケア履歴、その他の個人データは削除されません。
ko: 캐시는 다음 사용 시 다시 생성할 수 있습니다. 성적, 오답, 일기, 녹음, 건강 기록 또는 기타 개인 데이터는 삭제되지 않습니다.
zh_hans: 缓存可在下次使用时重新生成。此操作不会删除成绩、错题、日记、录音、健康历史或其他个人数据。
zh_hant: 快取可在下次使用時重新產生。此操作不會刪除成績、錯題、日記、錄音、健康記錄或其他個人資料。

source: Cache Management
ja: キャッシュ管理
ko: 캐시 관리
zh_hans: 缓存管理
zh_hant: 快取管理

source: Calculating Cache Size
ja: キャッシュサイズを計算中
ko: 캐시 크기 계산 중
zh_hans: 正在计算缓存大小
zh_hant: 正在計算快取大小

source: Calculator
ja: 電卓
ko: 계산기
zh_hans: 计算器
zh_hant: 計算機

source: Calendar
ja: カレンダー
ko: 캘린더
zh_hans: 日历
zh_hant: 行事曆

source: Calendar event not found.
ja: カレンダーイベントが見つかりません。
ko: 캘린더 이벤트를 찾을 수 없습니다.
zh_hans: 未找到日历事件。
zh_hant: 找不到日曆事件。

source: Calendar View
ja: カレンダー表示
ko: 캘린더 보기
zh_hans: 日历视图
zh_hant: 行事曆檢視

source: Calendar view is only available for exams.
ja: カレンダー表示は試験でのみ利用できます。
ko: 달력 보기는 시험에서만 사용할 수 있습니다.
zh_hans: 日历视图仅对考试可用。
zh_hant: 日曆檢視僅適用於考試。

source: Calm and recovered
ja: 落ち着いて回復中
ko: 차분하고 회복된 상태
zh_hans: 状态平稳，恢复良好
zh_hant: 狀態平穩，恢復良好

source: Camera
ja: カメラ
ko: 카메라
zh_hans: 相机
zh_hant: 相機

source: Can I customize my home dashboard?
ja: ホームダッシュボードをカスタマイズできますか？
ko: 홈 대시보드를 사용자 지정할 수 있나요？
zh_hans: 我可以自定义主页仪表盘吗？
zh_hant: 我可以自訂主頁儀表板嗎？

source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

source: Cannot read file: encoding not supported. Please make sure the file is a valid CSV file.
ja: ファイルを読み込めません：サポートされていないエンコーディングです。有効な CSV ファイルであることを確認してください。
ko: 파일을 읽을 수 없습니다: 지원되지 않는 인코딩입니다. 유효한 CSV 파일인지 확인하세요.
zh_hans: 无法读取文件：不支持的编码。请确认文件是有效的 CSV 文件。
zh_hant: 無法讀取檔案：不支援的編碼。請確認檔案是有效的 CSV 檔案。

source: Card
ja: カード
ko: 카드
zh_hans: 闪卡
zh_hant: 閃卡

source: cards
ja: 枚
ko: 장
zh_hans: 张
zh_hant: 張

source: Category
ja: カテゴリ
ko: 분류
zh_hans: 分类
zh_hant: 類別

source: Change
ja: 変更
ko: 변경
zh_hans: 修改
zh_hant: 修改

source: Change Avatar
ja: アバターを変更
ko: 아바타 변경
zh_hans: 更换头像
zh_hant: 更換大頭貼

source: Change vs. Last
ja: 前回比
ko: 최근 대비
zh_hans: 相对最近
zh_hant: 相對最近

source: Chart + Data + Suggestion
ja: チャート + データ + 提案
ko: 차트 + 데이터 + 제안
zh_hans: 图表 + 数据 + 建议
zh_hant: 圖表 + 資料 + 建議

source: Chart Analysis
ja: チャート分析
ko: 차트 분석
zh_hans: 图表分析
zh_hant: 圖表分析

source: Chart Type
ja: グラフの種類
ko: 차트 종류
zh_hans: 图表类型
zh_hant: 圖表類型

source: Check Body Status
ja: 身体状態を確認
ko: 신체 상태 확인
zh_hans: 查看身体状态
zh_hant: 查看身體狀態

source: Check Solution
ja: 解答を確認
ko: 해설 확인
zh_hans: 查看解析
zh_hant: 查看解析

source: Check Study Readiness
ja: 学習準備度を確認
ko: 학습 준비도 확인
zh_hans: 查看学习准备度
zh_hant: 查看學習準備度

source: Check Subject Average
ja: 科目の平均を確認
ko: 과목 평균 확인
zh_hans: 查看科目平均分
zh_hant: 查看科目平均分

source: Check Upcoming Exams
ja: 今後の試験を確認
ko: 다가오는 시험 확인
zh_hans: 查看即将到来的考试
zh_hant: 查看即將到來的考試

source: Check your average score for a subject over the last 6 months.
ja: 過去6ヶ月の科目の平均スコアを確認します。
ko: 지난 6개월 동안의 과목 평균 점수를 확인합니다.
zh_hans: 查看过去6个月科目的平均分数。
zh_hant: 查看過去6個月科目的平均分數。

source: Check your body status — sleep, heart rate, and exercise for today.
ja: 今日の身体状態（睡眠・心拍数・運動）を確認します。
ko: 오늘의 신체 상태(수면·심박수·운동)를 확인합니다.
zh_hans: 查看今天的身体状态——睡眠、心率和锻炼。
zh_hant: 查看今天的身體狀態——睡眠、心率和鍛煉。

source: Check your HRV-based study readiness and suggestions.
ja: HRVに基づく学習準備度とアドバイスを確認します。
ko: HRV 기반 학습 준비도와 조언을 확인합니다.
zh_hans: 查看基于HRV的学习准备度和建议。
zh_hant: 查看基於HRV的學習準備度和建議。

source: Check your notification center in 5 seconds!
ja: 通知センターを確認してください（5秒後）！
ko: 알림 센터를 확인하세요（5초 후）！
zh_hans: 请检查通知中心（5秒后）！
zh_hant: 請檢查通知中心（5秒後）！

source: Checklist
ja: チェックリスト
ko: 체크리스트
zh_hans: 清单
zh_hant: 清單

source: Chemistry
ja: 化学
ko: 화학
zh_hans: 化学
zh_hant: 化學

source: Chinese
ja: 中国語
ko: 중국어
zh_hans: 语文
zh_hant: 國文

source: Choose from Library
ja: ライブラリから選択
ko: 보관함에서 선택
zh_hans: 从相册选择
zh_hant: 從相簿選擇

# Choose how grades are visualized: line, bar, pie, scatter, or heatmap.
source: Choose how grades are visualized: line, bar, pie, scatter, heatmap, or histogram.
ja: 成績の可視化方法（折れ線・棒・円・散布・ヒートマップ・度数分布図）を選択します。
ko: 성적을 시각화하는 방식(꺾은선, 막대, 원형, 산점도, 히트맵, 도수 히스토그램)을 선택하세요.
zh_hans: 选择成绩的可视化方式：折线、柱状、饼图、散点、热力图或频数直方图。
zh_hant: 選擇成績的視覺化方式：折線、柱狀、圓餅、散佈、熱力圖或頻數直方圖。

source: Choose how scores are visualized across the app. This applies to Home, Trends, and Widgets.
ja: アプリ内のすべての成績グラフの表示方法を選択します。ホーム、推移、ウィジェットに適用されます。
ko: 앱 전체의 성적 차트 표시 방식을 선택하세요. 홈, 추세, 위젯에 적용됩니다.
zh_hans: 选择应用内所有成绩图表的展示方式，适用于主页、趋势页与小组件。
zh_hant: 選擇 App 內所有成績圖表的呈現方式，適用於主頁、趨勢頁與小工具。

source: Choose your preferred color scheme.
ja: 希望のカラースキームを選択してください
ko: 선호하는 색상 구성을 선택하세요
zh_hans: 选择你偏好的颜色方案
zh_hant: 選擇你偏好的色彩配置

source: Choose your subjects
ja: 科目を選択
ko: 과목 선택
zh_hans: 选择你的科目
zh_hant: 選擇你的科目

source: Class
ja: クラス
ko: 반
zh_hans: 班级
zh_hant: 班級

source: Classroom
ja: 教室
ko: 교실
zh_hans: 教室
zh_hant: 教室

source: Clear
ja: クリア
ko: 지우기
zh_hans: 清空
zh_hant: 清空

source: Clear All Cache
ja: すべてのキャッシュを消去
ko: 모든 캐시 지우기
zh_hans: 清除全部缓存
zh_hant: 清除全部快取

source: Clear All Cache?
ja: すべてのキャッシュを消去しますか？
ko: 모든 캐시를 지우시겠습니까?
zh_hans: 清除全部缓存？
zh_hant: 清除全部快取？

source: Clear All Diary Entries
ja: すべての日記を削除
ko: 모든 일기 삭제
zh_hans: 清除所有日记
zh_hant: 清除所有日記

source: Clear Cache
ja: キャッシュを消去
ko: 캐시 지우기
zh_hans: 清除缓存
zh_hant: 清除快取

source: Clear conversation
ja: 会話を消去
ko: 대화 지우기
zh_hans: 清空对话
zh_hant: 清除對話

source: Clear one overdue task first.
ja: 期限切れのタスクを一つ先に片付けましょう。
ko: 기한이 지난 할 일을 하나 먼저 처리하세요.
zh_hans: 先清理一项逾期任务。
zh_hant: 先清理一項逾期任務。

source: Clear Override
ja: 上書きをクリア
ko: 재정의 지우기
zh_hant: 清除覆寫

source: Clear search
ja: 検索をクリア
ko: 검색 지우기
zh_hans: 清除搜索
zh_hant: 清除搜尋

source: Clear Selected Cache
ja: 選択したキャッシュを消去
ko: 선택한 캐시 지우기
zh_hans: 清除所选缓存
zh_hant: 清除所選快取

source: Clear Selected Cache?
ja: 選択したキャッシュを消去しますか？
ko: 선택한 캐시를 지우시겠습니까?
zh_hans: 清除所选缓存？
zh_hant: 清除所選快取？

source: Clearable Disk Space
ja: 消去可能なディスク容量
ko: 정리 가능한 디스크 공간
zh_hans: 可清理磁盘空间
zh_hant: 可清除的磁碟空間

source: Clearing Cache
ja: キャッシュを消去中
ko: 캐시 지우는 중
zh_hans: 正在清理缓存
zh_hant: 正在清除快取

source: Click to View Full Legal Code in Browser
ja: クリックしてブラウザで完全な法本文を表示
ko: 브라우저에서 전체 법적 본문 보기
zh_hans: 点击在浏览器中查看完整法律文本
zh_hant: 點擊在瀏覽器中檢視完整法律全文

source: Click to View the Repository on Github
ja: GitHub リポジトリを表示
ko: GitHub 저장소 보기
zh_hans: 点击查看 GitHub 仓库
zh_hant: 點擊查看 GitHub 專案

source: Close
ja: 閉じる
ko: 닫기
zh_hans: 关闭
zh_hant: 關閉

source: Coach History
ja: Coach 履歴
ko: Coach 기록
zh_hans: Coach 历史
zh_hant: Coach 歷史

# Coach prompt 01
source: What would you like to talk about today?
ja: 今日は何について話しましょうか？
ko: 오늘은 무엇에 대해 이야기해 볼까요?
zh_hans: 今天想聊点什么？
zh_hant: 今天想聊點什麼？

# Coach prompt 02
source: What study tasks do you still have today?
ja: 今日はどんな勉強のタスクが残っていますか？
ko: 오늘 아직 남은 공부 과제는 무엇인가요?
zh_hans: 今天还有什么学习任务？
zh_hant: 今天還有什麼學習任務？

# Coach prompt 03
source: Want to make a simple plan for today?
ja: 今日の簡単な計画を一緒に立てますか？
ko: 오늘의 간단한 계획을 함께 세워 볼까요?
zh_hans: 要不要一起做一个简单的今日计划？
zh_hant: 要不要一起做個簡單的今日計畫？

# Coach prompt 04
source: How is your study progress going?
ja: 最近の勉強の進み具合はいかがですか？
ko: 요즘 공부는 잘 진행되고 있나요?
zh_hans: 最近的学习进展怎么样？
zh_hant: 最近的學習進度如何？

# Coach prompt 05
source: Which subject should we focus on first?
ja: まずどの科目に取り組みましょうか？
ko: 어떤 과목부터 집중해 볼까요?
zh_hans: 我们先从哪一门学科开始？
zh_hant: 我們先從哪一科開始？

# Coach prompt 06
source: Is there a difficult topic you want to untangle?
ja: 整理したい難しいテーマはありますか？
ko: 정리하고 싶은 어려운 주제가 있나요?
zh_hans: 有没有想弄明白的难点？
zh_hant: 有沒有想弄懂的難題？

# Coach prompt 07
source: Want to review your upcoming exams?
ja: これからの試験を一緒に確認しますか？
ko: 다가오는 시험을 함께 확인해 볼까요?
zh_hans: 要不要一起看看接下来的考试？
zh_hant: 要不要一起看看接下來的考試？

# Coach prompt 08
source: What is your biggest study challenge right now?
ja: 今いちばん大きな勉強の課題は何ですか？
ko: 지금 가장 큰 공부의 어려움은 무엇인가요?
zh_hans: 现在最大的学习挑战是什么？
zh_hant: 現在最大的學習挑戰是什麼？

# Coach prompt 09
source: Need help deciding what to do next?
ja: 次に何をするか、決めるのを手伝いましょうか？
ko: 다음에 무엇을 할지 정하는 데 도움이 필요하신가요?
zh_hans: 需要帮你决定下一步做什么吗？
zh_hant: 需要我幫你決定下一步嗎？

# Coach prompt 10
source: How are your energy and focus today?
ja: 今日の元気と集中力はいかがですか？
ko: 오늘의 에너지와 집중력은 어떤가요?
zh_hans: 今天的精力和专注度怎么样？
zh_hant: 今天的精力和專注力如何？

# Coach prompt 11
source: Want to turn a goal into the next small step?
ja: 目標を次の小さな一歩に分けてみますか？
ko: 목표를 다음 작은 단계로 나누어 볼까요?
zh_hans: 要不要把一个目标拆成下一个小步骤？
zh_hant: 要不要把一個目標拆成下一個小步驟？

# Coach prompt 12
source: What went well in your studies today?
ja: 今日の勉強で、うまくできたことは何ですか？
ko: 오늘 공부하면서 잘한 점은 무엇인가요?
zh_hans: 今天的学习中，什么地方做得不错？
zh_hant: 今天的學習中，哪裡做得不錯？

# Coach prompt 13
source: Is there a mistake you would like to revisit?
ja: もう一度振り返りたい間違いはありますか？
ko: 다시 복습하고 싶은 오답이 있나요?
zh_hans: 有没有想重新复盘的一道错题？
zh_hant: 有沒有想重新複習的錯題？

# Coach prompt 14
source: Want to plan a focused study session?
ja: 集中して勉強する時間を計画しますか？
ko: 집중해서 공부할 시간을 계획해 볼까요?
zh_hans: 要不要安排一段专注学习时间？
zh_hant: 要不要安排一段專注學習時間？

# Coach prompt 15
source: Tell me what is on your mind about studying.
ja: 勉強について思っていることを聞かせてください。
ko: 공부에 대해 어떤 생각이든 들려주세요.
zh_hans: 关于学习，有什么想法都可以告诉我。
zh_hant: 關於學習，有什麼想法都可以告訴我。

source: Collecting
ja: 収集中
ko: 수집 중
zh_hans: 收集中
zh_hant: 收集中

source: Comma separated
ja: カンマ区切り
ko: 쉼표로 구분
zh_hans: 用逗号分隔
zh_hant: 用逗號分隔

# common.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

source: Compare today's HRV to your personal 14-day baseline
ja: 今日の HRV をあなたの 14 日間のベースラインと比較します
ko: 오늘의 HRV를 개인 14일 기준선과 비교
zh_hans: 将今天的 HRV 与你个人的 14 天基线进行比较
zh_hant: 將今天的 HRV 與你個人的 14 天基準進行比較

source: Completed
ja: 完了
ko: 완료
zh_hans: 已完成
zh_hant: 已完成

source: Completed Goals
ja: 完了した目標
ko: 완료된 목표
zh_hans: 已完成目标
zh_hant: 已完成目標

source: Compre.
ja: 総合
ko: 종합
zh_hans: 综合
zh_hant: 綜合

source: Comprehensive
ja: 総合
ko: 종합
zh_hans: 综合
zh_hant: 綜合

source: Comprehensive Exam
ja: 総合試験
ko: 통합 시험
zh_hans: 综合考试
zh_hant: 綜合考試

source: Comprehensive Exam: %@
ja: 総合試験：%@
ko: 종합 시험: %@
zh_hans: 综合考试：%@
zh_hant: 綜合考試：%@

source: Concept
ja: 核心知識点
ko: 핵심 지식점
zh_hans: 核心知识点
zh_hant: 核心知識點

source: Confident
ja: 自信あり
ko: 자신감
zh_hans: 比较自信
zh_hant: 比較自信

source: Configure Brain Usage
ja: 脳の使用量を設定
ko: 두뇌 사용량 설정
zh_hans: 配置大脑使用量
zh_hant: 設定大腦使用量

source: Confirm Restore
ja: 復元の確認
ko: 복원 확인
zh_hans: 确认恢复
zh_hant: 確認還原

source: Connect Apple Health to read your HRV and get personalized study readiness suggestions.
ja: Apple ヘルスケアと連携し、HRV データを読み取って個別の学習準備度提案を取得します。
ko: Apple 건강 앱과 연결하여 HRV 데이터를 읽고 맞춤형 학습 준비도 제안을 받습니다.
zh_hans: 连接 Apple 健康，读取 HRV 数据，获取个性化的学习准备度建议。
zh_hant: 連接 Apple 健康，讀取 HRV 資料，獲取個人化的學習準備度建議。

source: Connect your own OpenAI-compatible LLM endpoint. All requests go directly to the URL you provide.
ja: OpenAI 互換の LLM エンドポイントを接続します。リクエストは指定した URL に直接送信されます。
ko: OpenAI 호환 LLM 엔드포인트를 연결합니다. 모든 요청은 입력한 URL로 직접 전송됩니다.
zh_hans: 连接你自有的 OpenAI 兼容大模型端点。所有请求都直接发往你填写的 URL,StudyPulse 不会代理。
zh_hant: 連接你自有的 OpenAI 相容大模型端點。所有請求都直接發往你填寫的 URL,StudyPulse 不會代理。

source: Connection failed
ja: 接続失敗
ko: 연결 실패
zh_hans: 连接失败
zh_hant: 連線失敗

source: Connection successful
ja: 接続成功
ko: 연결 성공
zh_hans: 连接成功
zh_hant: 連線成功

source: Constraints
ja: 制約
ko: 제한 조건
zh_hans: 限制条件
zh_hant: 限制條件

source: Content stored in CONTRIBUTING.json and shipped as a bundle resource.
ja: コンテンツは CONTRIBUTING.json に保存され、Bundle リソースとして同梱されています。
ko: 콘텐츠는 CONTRIBUTING.json에 저장되어 번들 리소스로 동봉됩니다.
zh_hans: 内容存储于 CONTRIBUTING.json，并作为 Bundle 资源打包。
zh_hant: 內容儲存於 CONTRIBUTING.json，並作為 Bundle 資源打包。

source: Continue
ja: 続行
ko: 계속
zh_hans: 继续
zh_hant: 繼續

source: Contribution
ja: 貢献
ko: 기여
zh_hans: 贡献指南
zh_hant: 貢獻指南

source: Contribution Guide Not Available
ja: 貢献ガイドは利用できません
ko: 기여 가이드를 사용할 수 없음
zh_hans: 贡献指南不可用
zh_hant: 貢獻指南不可用

source: Controls how often the Recovery Radar automatically asks the LLM. Analyze now can bypass this cooldown.
ja: リカバリーレーダーが LLM に自動分析を依頼する頻度を設定します。「今すぐ分析」はこのクールダウンを無視できます。
ko: 회복 레이더가 LLM에 자동 분석을 요청하는 주기를 설정합니다. ‘지금 분석’은 이 대기 시간을 건너뛸 수 있습니다.
zh_hans: 控制恢复雷达自动请求大模型的频率。“立刻分析”可以绕过此冷却时间。
zh_hant: 控制恢復雷達自動請求大型語言模型的頻率。「立即分析」可以繞過此冷卻時間。

source: Cooldown %@
ja: クールダウン %@
ko: 대기 %@
zh_hans: 冷却 %@
zh_hant: 冷卻 %@

source: Copy JSON
ja: JSON コピー
ko: JSON 복사
zh_hant: 複製 JSON

source: Copyright
ja: 著作権情報
ko: 저작권 정보
zh_hans: 版权信息
zh_hant: 版權資訊

source: Copyright & License
ja: 著作権とライセンス
ko: 저작권 및 라이선스
zh_hans: 版权与许可
zh_hant: 版權與授權

source: Correct Solution
ja: 正しい解答
ko: 올바른 풀이
zh_hans: 正确解答
zh_hant: 正確解答

source: Could not create backup: %@
ja: バックアップを作成できません：%@
ko: 백업을 만들 수 없습니다: %@
zh_hans: 无法创建备份：%@
zh_hant: 無法建立備份：%@

source: Could not restore backup: %@
ja: バックアップを復元できません：%@
ko: 백업을 복원할 수 없습니다: %@
zh_hans: 无法恢复备份：%@
zh_hant: 無法還原備份：%@

source: Count how often scores fall into each 20% bucket.
ja: 20% 刻みの各得率帯に成績が何回入ったかを集計します。
ko: 20% 득점율 구간별로 성적이 몇 번 포함되는지 집계합니다.
zh_hans: 按 20% 得分率统计每个区间的成绩次数。
zh_hant: 依 20% 得分率統計每個區間的成績次數。

source: Countdown Notifications
ja: カウントダウン通知
ko: 카운트다운 알림
zh_hans: 倒计时通知
zh_hant: 倒數通知

source: Cover
ja: 表紙
ko: 표지
zh_hans: 封面
zh_hant: 封面

source: Create Full Backup
ja: 完全バックアップを作成
ko: 전체 백업 만들기
zh_hans: 创建完整备份
zh_hant: 建立完整備份

source: Create semester, break, or sprint phases to scope your data.
ja: 学期・休暇・冲刺フェーズを作成してデータを整理できます。
ko: 학기·방학·스프린트 단계를 만들어 데이터를 정리하세요.
zh_hans: 创建学期、假期或冲刺阶段来给数据划定边界。
zh_hant: 建立學期、假期或衝刺階段來給資料劃定邊界。

source: Creates a new mistake note from this review, auto-enrolled in SRS.
ja: この振り返りからミスノートを作成し、SRS 復習キューに自動登録します。
ko: 이 회고로 오답 노트를 생성하고 SRS 복습 큐에 자동 등록합니다.
zh_hans: 基于本复盘创建一张错题,并自动加入 SRS 复习队列。
zh_hant: 基於本復盤建立一張錯題,並自動加入 SRS 複習佇列。

source: Creating backup…
ja: バックアップを作成中…
ko: 백업 만드는 중…
zh_hans: 正在创建备份…
zh_hant: 正在建立備份…
